I'm at a loss. Here's my test:
```
terraform version
Terraform v0.12.21
+ provider.signalfx (unversioned) <-- that's the current HEAD from master
```

First config:
```
resource "signalfx_dashboard_group" "mydashboardgroup0" {
    name = "My team dashboard group"
    description = "Cool dashboard group"
}

resource "signalfx_time_chart" "mychart0" {
    name = "CPU Total Idle"

    program_text = <<-EOF
        data("cpu.total.idle").publish(label="CPU Idle")
        EOF

}

resource "signalfx_dashboard" "mydashboard0" {
    name = "My Dashboard"
    dashboard_group = signalfx_dashboard_group.mydashboardgroup0.id

    time_range = "-30m"

    filter {
        property = "collector"
        values = ["cpu", "Diamond"]
    }
    variable {
        property = "region"
        alias = "region"
        values = ["uswest-1-"]
    }
    chart {
        chart_id = signalfx_time_chart.mychart0.id
        width = 12
        height = 1
    }
}
```

Applies fine. Change config to:
```
resource "signalfx_dashboard_group" "mydashboardgroup0" {
    name = "My team dashboard group"
    description = "Cool dashboard group"
}

resource "signalfx_time_chart" "mychart1" {
    name = "CPU Total Idle"

    program_text = <<-EOF
        data("cpu.total.idle").publish(label="CPU Idle")
        EOF

}

resource "signalfx_dashboard" "mydashboard0" {
    name = "My Dashboard"
    dashboard_group = signalfx_dashboard_group.mydashboardgroup0.id

    time_range = "-30m"

    filter {
        property = "collector"
        values = ["cpu", "Diamond"]
    }
    variable {
        property = "region"
        alias = "region"
        values = ["uswest-1-"]
    }
    chart {
        chart_id = signalfx_time_chart.mychart1.id
        width = 12
        height = 1
    }
}
```
Note the rename of the existing chart.

Apply output:
```
terraform apply
signalfx_dashboard_group.mydashboardgroup0: Refreshing state... [id=ESHxxCkAgAE]
signalfx_time_chart.mychart0: Refreshing state... [id=ESHx8xGAYAA]
signalfx_dashboard.mydashboard0: Refreshing state... [id=ESHxqnAAYAA]

An execution plan has been generated and is shown below.
Resource actions are indicated with the following symbols:
  + create
  ~ update in-place
  - destroy

Terraform will perform the following actions:

  # signalfx_dashboard.mydashboard0 will be updated in-place
  ~ resource "signalfx_dashboard" "mydashboard0" {
        charts_resolution = "default"
        dashboard_group   = "ESHxxCkAgAE"
        id                = "ESHxqnAAYAA"
        name              = "My Dashboard"
        time_range        = "-30m"
        url               = "https://app.signalfx.com/#/dashboard/ESHxqnAAYAA"

      - chart {
          - chart_id = "ESHx8xGAYAA" -> null
          - column   = 0 -> null
          - height   = 1 -> null
          - row      = 0 -> null
          - width    = 12 -> null
        }
      + chart {
          + chart_id = (known after apply)
          + height   = 1
          + width    = 12
        }

        filter {
            apply_if_exist = false
            negated        = false
            property       = "collector"
            values         = [
                "Diamond",
                "cpu",
            ]
        }

        variable {
            alias                  = "region"
            apply_if_exist         = false
            property               = "region"
            replace_only           = false
            restricted_suggestions = false
            value_required         = false
            values                 = [
                "uswest-1-",
            ]
            values_suggested       = []
        }
    }

  # signalfx_time_chart.mychart0 will be destroyed
  - resource "signalfx_time_chart" "mychart0" {
      - axes_include_zero = false -> null
      - axes_precision    = 3 -> null
      - color_by          = "Dimension" -> null
      - disable_sampling  = false -> null
      - id                = "ESHx8xGAYAA" -> null
      - name              = "CPU Total Idle" -> null
      - plot_type         = "LineChart" -> null
      - program_text      = <<~EOT
            data("cpu.total.idle").publish(label="CPU Idle")
        EOT -> null
      - show_data_markers = false -> null
      - show_event_lines  = false -> null
      - stacked           = false -> null
      - tags              = [] -> null
      - time_range        = 0 -> null
      - timezone          = "UTC" -> null
      - unit_prefix       = "Metric" -> null
      - url               = "https://app.signalfx.com/#/chart/ESHx8xGAYAA" -> null
    }

  # signalfx_time_chart.mychart1 will be created
  + resource "signalfx_time_chart" "mychart1" {
      + axes_precision   = 3
      + color_by         = "Dimension"
      + disable_sampling = false
      + id               = (known after apply)
      + name             = "CPU Total Idle"
      + plot_type        = "LineChart"
      + program_text     = <<~EOT
            data("cpu.total.idle").publish(label="CPU Idle")
        EOT
      + stacked          = false
      + timezone         = "UTC"
      + unit_prefix      = "Metric"
      + url              = (known after apply)
    }

Plan: 1 to add, 1 to change, 1 to destroy.

Do you want to perform these actions?
  Terraform will perform the actions described above.
  Only 'yes' will be accepted to approve.

  Enter a value: yes

signalfx_time_chart.mychart0: Destroying... [id=ESHx8xGAYAA]
signalfx_time_chart.mychart1: Creating...
signalfx_time_chart.mychart0: Destruction complete after 0s
signalfx_time_chart.mychart1: Creation complete after 0s [id=ESIOtAVAgAU]
signalfx_dashboard.mydashboard0: Modifying... [id=ESHxqnAAYAA]
signalfx_dashboard.mydashboard0: Modifications complete after 1s [id=ESHxqnAAYAA]

Apply complete! Resources: 1 added, 1 changed, 1 destroyed.
```

Everything works.

